Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EV256GM002.h
extern volatile AD1CSSLBITS AD1CSSLbits __attribute__((__sfr__));

#define AD1CON4 AD1CON4
extern volatile unsigned int  AD1CON4 __attribute__((__sfr__));
__extension__ typedef struct tagAD1CON4BITS {
  union {
    struct {
      unsigned DMABL:3;
      unsigned :5;
      unsigned ADDMAEN:1;
    };
    struct {
      unsigned DMABL0:1;
      unsigned DMABL1:1;
      unsigned DMABL2:1;
    };
  };
} AD1CON4BITS;
extern volatile AD1CON4BITS AD1CON4bits __attribute__((__sfr__));

#define CTMUCON1 CTMUCON1
extern volatile unsigned int  CTMUCON1 __attribute__((__sfr__));
typedef struct tagCTMUCON1BITS {
  unsigned :8;
  unsigned CTTRIG:1;
  unsigned IDISSEN:1;
  unsigned EDGSEQEN:1;
  unsigned EDGEN:1;
  unsigned TGEN:1;
  unsigned CTMUSIDL:1;
  unsigned :1;
  unsigned CTMUEN:1;
} CTMUCON1BITS;
extern volatile CTMUCON1BITS CTMUCON1bits __attribute__((__sfr__));

#define CTMUCON2 CTMUCON2
extern volatile unsigned int  CTMUCON2 __attribute__((__sfr__));
__extension__ typedef struct tagCTMUCON2BITS {
  union {
    struct {
      unsigned :2;
      unsigned EDG2SEL:4;
      unsigned EDG2POL:1;
      unsigned EDG2MOD:1;
      unsigned EDG1STAT:1;
      unsigned EDG2STAT:1;
      unsigned EDG1SEL:4;
      unsigned EDG1POL:1;
      unsigned EDG1MOD:1;
    };
    struct {
      unsigned :2;
      unsigned EDG2SEL0:1;
      unsigned EDG2SEL1:1;
      unsigned EDG2SEL2:1;
      unsigned EDG2SEL3:1;
      unsigned :4;
      unsigned EDG1SEL0:1;
      unsigned EDG1SEL1:1;
      unsigned EDG1SEL2:1;
      unsigned EDG1SEL3:1;
    };
  };
} CTMUCON2BITS;
extern volatile CTMUCON2BITS CTMUCON2bits __attribute__((__sfr__));

#define CTMUICON CTMUICON
extern volatile unsigned int  CTMUICON __attribute__((__sfr__));
__extension__ typedef struct tagCTMUICONBITS {
  union {
    struct {
      unsigned :8;
      unsigned IRNG:2;
      unsigned ITRIM:6;
    };
    struct {
      unsigned :8;
      unsigned IRNG0:1;
      unsigned IRNG1:1;
      unsigned ITRIM0:1;
      unsigned ITRIM1:1;
      unsigned ITRIM2:1;
      unsigned ITRIM3:1;
      unsigned ITRIM4:1;
      unsigned ITRIM5:1;
    };
  };
} CTMUICONBITS;
extern volatile CTMUICONBITS CTMUICONbits __attribute__((__sfr__));

#define SENT1CON1 SENT1CON1
extern volatile unsigned int  SENT1CON1 __attribute__((__sfr__));
typedef struct tagSENT1CON1BITS {
  unsigned NIBCNT:3;
  unsigned :1;
  unsigned PS:1;
  unsigned :1;
  unsigned SPCEN:1;
  unsigned PPP:1;
  unsigned CRCEN:1;
  unsigned TXPOL:1;
  unsigned TXM:1;
  unsigned RCVEN:1;
  unsigned :1;
  unsigned SNTSIDL:1;
  unsigned :1;
  unsigned SNTEN:1;
} SENT1CON1BITS;
extern volatile SENT1CON1BITS SENT1CON1bits __attribute__((__sfr__));

#define SENT1CON2 SENT1CON2
extern volatile unsigned int  SENT1CON2 __attribute__((__sfr__));
#define SENT1CON3 SENT1CON3
extern volatile unsigned int  SENT1CON3 __attribute__((__sfr__));
#define SENT1STAT SENT1STAT
extern volatile unsigned int  SENT1STAT __attribute__((__sfr__));
__extension__ typedef struct tagSENT1STATBITS {
  union {
    struct {
      unsigned SYNC:1;
      unsigned RXIDLE:1;
      unsigned FRMERR:1;
      unsigned CRCERR:1;
      unsigned NIB:3;
      unsigned PAUSE:1;
    };
    struct {
      unsigned TXEN:1;
    };
    struct {
      unsigned :4;
      unsigned NIB0:1;
      unsigned NIB1:1;
      unsigned NIB2:1;
    };
  };
} SENT1STATBITS;
extern volatile SENT1STATBITS SENT1STATbits __attribute__((__sfr__));

#define SENT1SYNC SENT1SYNC
extern volatile unsigned int  SENT1SYNC __attribute__((__sfr__));
#define SENT1DATL SENT1DATL
extern volatile unsigned int  SENT1DATL __attribute__((__sfr__));
__extension__ typedef struct tagSENT1DATLBITS {
  union {
    struct {
      unsigned CRC:4;
      unsigned DATA6:4;
      unsigned DATA5:4;
      unsigned DATA4:4;
    };
    struct {
      unsigned CRC0:1;
      unsigned CRC1:1;
      unsigned CRC2:1;
      unsigned CRC3:1;
      unsigned DATA60:1;
      unsigned DATA61:1;
      unsigned DATA62:1;
      unsigned DATA63:1;
      unsigned DATA50:1;
      unsigned DATA51:1;
      unsigned DATA52:1;
      unsigned DATA53:1;
      unsigned DATA40:1;
      unsigned DATA41:1;
      unsigned DATA42:1;
      unsigned DATA43:1;
    };
  };
} SENT1DATLBITS;
extern volatile SENT1DATLBITS SENT1DATLbits __attribute__((__sfr__));

#define SENT1DATH SENT1DATH
extern volatile unsigned int  SENT1DATH __attribute__((__sfr__));
__extension__ typedef struct tagSENT1DATHBITS {
  union {
    struct {
      unsigned DATA3:4;
      unsigned DATA2:4;
      unsigned DATA1:4;
      unsigned STAT:4;
    };
    struct {
      unsigned DATA30:1;
      unsigned DATA31:1;
      unsigned DATA32:1;
      unsigned DATA33:1;
      unsigned DATA20:1;
      unsigned DATA21:1;
      unsigned DATA22:1;
      unsigned DATA23:1;
      unsigned DATA10:1;
      unsigned DATA11:1;
      unsigned DATA12:1;
      unsigned DATA13:1;
      unsigned STAT0:1;
      unsigned STAT1:1;
      unsigned STAT2:1;
      unsigned STAT3:1;
    };
  };
} SENT1DATHBITS;
extern volatile SENT1DATHBITS SENT1DATHbits __attribute__((__sfr__));

#define SENT2CON1 SENT2CON1
extern volatile unsigned int  SENT2CON1 __attribute__((__sfr__));
typedef struct tagSENT2CON1BITS {
  unsigned NIBCNT:3;
  unsigned :1;
  unsigned PS:1;
  unsigned :1;
  unsigned SPCEN:1;
  unsigned PPP:1;
  unsigned CRCEN:1;
  unsigned TXPOL:1;
  unsigned TXM:1;
  unsigned RCVEN:1;
  unsigned :1;
  unsigned SNTSIDL:1;
  unsigned :1;
  unsigned SNTEN:1;
} SENT2CON1BITS;
extern volatile SENT2CON1BITS SENT2CON1bits __attribute__((__sfr__));

#define SENT2CON2 SENT2CON2
extern volatile unsigned int  SENT2CON2 __attribute__((__sfr__));
#define SENT2CON3 SENT2CON3
extern volatile unsigned int  SENT2CON3 __attribute__((__sfr__));
#define SENT2STAT SENT2STAT
extern volatile unsigned int  SENT2STAT __attribute__((__sfr__));
__extension__ typedef struct tagSENT2STATBITS {
  union {
    struct {
      unsigned SYNC:1;
      unsigned RXIDLE:1;
      unsigned FRMERR:1;
      unsigned CRCERR:1;
      unsigned NIB:3;
      unsigned PAUSE:1;
    };
    struct {
      unsigned TXEN:1;
    };
    struct {
      unsigned :4;
      unsigned NIB0:1;
      unsigned NIB1:1;
      unsigned NIB2:1;
    };
  };
} SENT2STATBITS;
extern volatile SENT2STATBITS SENT2STATbits __attribute__((__sfr__));

#define SENT2SYNC SENT2SYNC
extern volatile unsigned int  SENT2SYNC __attribute__((__sfr__));
#define SENT2DATL SENT2DATL
extern volatile unsigned int  SENT2DATL __attribute__((__sfr__));
__extension__ typedef struct tagSENT2DATLBITS {
  union {
    struct {
      unsigned CRC:4;
      unsigned DATA6:4;
      unsigned DATA5:4;
      unsigned DATA4:4;
    };
    struct {
      unsigned CRC0:1;
      unsigned CRC1:1;
      unsigned CRC2:1;
      unsigned CRC3:1;
      unsigned DATA60:1;
      unsigned DATA61:1;
      unsigned DATA62:1;
      unsigned DATA63:1;
      unsigned DATA50:1;
      unsigned DATA51:1;
      unsigned DATA52:1;
      unsigned DATA53:1;
      unsigned DATA40:1;
      unsigned DATA41:1;
      unsigned DATA42:1;
      unsigned DATA43:1;
    };
  };
} SENT2DATLBITS;
extern volatile SENT2DATLBITS SENT2DATLbits __attribute__((__sfr__));

#define SENT2DATH SENT2DATH
extern volatile unsigned int  SENT2DATH __attribute__((__sfr__));
__extension__ typedef struct tagSENT2DATHBITS {
  union {
    struct {
      unsigned DATA3:4;
      unsigned DATA2:4;
      unsigned DATA1:4;
      unsigned STAT:4;
    };
    struct {
      unsigned DATA30:1;
      unsigned DATA31:1;
      unsigned DATA32:1;
      unsigned DATA33:1;
      unsigned DATA20:1;
      unsigned DATA21:1;
      unsigned DATA22:1;
      unsigned DATA23:1;
      unsigned DATA10:1;
      unsigned DATA11:1;
      unsigned DATA12:1;
      unsigned DATA13:1;
      unsigned STAT0:1;
      unsigned STAT1:1;
      unsigned STAT2:1;
      unsigned STAT3:1;
    };
  };
} SENT2DATHBITS;
extern volatile SENT2DATHBITS SENT2DATHbits __attribute__((__sfr__));

#define RPOR0 RPOR0
extern volatile unsigned int  RPOR0 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR0BITS {
  union {
    struct {
      unsigned RP20R:6;
      unsigned :2;
      unsigned RP35R:6;
    };
    struct {
      unsigned RP20R0:1;
      unsigned RP20R1:1;
      unsigned RP20R2:1;
      unsigned RP20R3:1;
      unsigned RP20R4:1;
      unsigned RP20R5:1;
      unsigned :2;
      unsigned RP35R0:1;
      unsigned RP35R1:1;
      unsigned RP35R2:1;
      unsigned RP35R3:1;
      unsigned RP35R4:1;
      unsigned RP35R5:1;
    };
  };
} RPOR0BITS;
extern volatile RPOR0BITS RPOR0bits __attribute__((__sfr__));

#define RPOR1 RPOR1
extern volatile unsigned int  RPOR1 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR1BITS {
  union {
    struct {
      unsigned RP36R:6;
      unsigned :2;
      unsigned RP37R:6;
    };
    struct {
      unsigned RP36R0:1;
      unsigned RP36R1:1;
      unsigned RP36R2:1;
      unsigned RP36R3:1;
      unsigned RP36R4:1;
      unsigned RP36R5:1;
      unsigned :2;
      unsigned RP37R0:1;
      unsigned RP37R1:1;
      unsigned RP37R2:1;
      unsigned RP37R3:1;
      unsigned RP37R4:1;
      unsigned RP37R5:1;
    };
  };
} RPOR1BITS;
extern volatile RPOR1BITS RPOR1bits __attribute__((__sfr__));

#define RPOR2 RPOR2
extern volatile unsigned int  RPOR2 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR2BITS {
  union {
    struct {
      unsigned RP38R:6;
      unsigned :2;
      unsigned RP39R:6;
    };
    struct {
      unsigned RP38R0:1;
      unsigned RP38R1:1;
      unsigned RP38R2:1;
      unsigned RP38R3:1;
      unsigned RP38R4:1;
      unsigned RP38R5:1;
      unsigned :2;
      unsigned RP39R0:1;
      unsigned RP39R1:1;
      unsigned RP39R2:1;
      unsigned RP39R3:1;
      unsigned RP39R4:1;
      unsigned RP39R5:1;
    };
  };
} RPOR2BITS;
